open System.Text.RegularExpressions
    
let ParseCell listStr =
    
    let startTime =   "(?:(С ?[0-9]{1,2}:[0-9]{1,2}) ?)?"    
    let subject =     "([А-Я ]*[А-Я]+)"
    let typeSubject = "(\(.*\))"
    let position =    "(?:АСС\.|СТ\. ?ПР\.|ДОЦ\.|ПРОФ\.|К\.И\.Н\.)"
    let teacher =     "(?:[А-Я-]* [А-Я]\. ?[А-Я]\.)"
    let classroom =   "(?:[0-9-/,]*[0-9])"
    let endTime =     "(?: ?(ДО ?[0-9]{1,2}:[0-9]{1,2}))?"
    
    let regEx =     
        Regex(sprintf "^%s%s(?: ?%s)?(?:((?: ?%s)?(?: ?%s)?(?: ?%s)?),?)*?%s$" startTime subject typeSubject position teacher classroom endTime)
    let regExInfo = 
        Regex(sprintf "^(?: ?(%s))?(?: ?(%s))?(?: ?(%s))?$" position teacher classroom)
    
    List.map(fun str -> 
                let result = regEx.Match(str)
                if result.Success then 
                    let groups = result.Groups
                    let listInfo = 
                        List.map (fun x -> 
                                    let listInfo = regExInfo.Match(x).Groups
                                    (listInfo.[1].Value, listInfo.[2].Value, listInfo.[3].Value)
                                    ) [for y in groups.[4].Captures -> y.Value]
                    let time = List.filter (fun x -> x <> "") [groups.[1].Value; groups.[5].Value]
                    Some (groups.[2].Value, groups.[3].Value, time, listInfo)
                else None
            ) listStr
   
let testList =    [
                    "Практикум на ЭВМ Григорьев 2408 Чернышев 2406"
                    
                    "Практикум на ЭВМ ст. пр. Кузьменко В.Г. ст. пр. Корявко А.В. 2412"
                    "Математический анализ (пр.) ст. пр. Дубова Т.П. 2507"
                    "Программирование (пр.) ст. пр. Губанов Ю.А. 2406/1509 ст. пр. Сартасов С.Ю. 1509/2406"
                    "ДИФФЕРЕНЦИАЛЬНЫЕ УРАВНЕНИЯ (лекц.) проф. Бибиков Ю.Н. 11"
                    "ДИФФЕРЕНЦИАЛЬНАЯ ГЕОМЕТРИЯ И ТЕНЗОРНЫЙ АНАЛИЗ (лекц.) доц. Лебедева Н.Д. 3532"
                    "КОМПЬЮТЕРНЫЕ СЕТИ (пр.) проф. Сафонов В.О. 2446"
                    "АНГЛИЙСКИЙ ЯЗЫК (пр. з.) (I,II траектории)ст. пр. Ибрагимова Д.Х., доц. Горшкова Е.А., ст.пр. Акимова Н.Н., ст. пр. Васильева Н.П., ст. пр. Звягина А.Н."
                    "Военная кафедра"
                    "ИНОСТРАННЫЙ ЯЗЫК (II траектория)"
                    "ВВЕДЕНИЕ В СПЕЦИАЛЬНОСТЬ (лекц.) 405"
                    "Математический анализ (пр.) доц. Петров Ф.В. 34"
                    "Геометрия и топология (пр.) доц. Романовский Ю.Р. 11"
                    "Вычислительный практикум (пр. з.) доц. Тараканов П.А. 1128 асс. Прокопьева М.А. 2444-1"
                    "Современные проблемы астрономии (лек., факульт.) доц. Сотникова Н.Я. 2143"
                    "Программирование (пр.) ст. пр. Юдин Ю.Б. 2410 ст. пр. Кузьменко В.Г. 2408"
                    "Программирование (пр.) доц. Лебединский Д.М. 2410"
                    "Практикум на ЭВМ доц. Яхонтов С.В. доц. Григорьев Д.А. 2444-1,2"
                    "Практикум на ЭВМ ст. пр. Алимова О.В. 2406 доц. Ловягин Н.Ю. 2444-2"
                    "с 10:20 Введение в программную инженерию (лекц.) доц. Кознов Д.В. 1506"
                    "Введение в программную инженерию (лекц.) доц. Кознов Д.В. До 18:00"
                    "Дифференциальные уравнения (пр.) доц. Звягинцева Т.Е. 14 до 18:00"
                    "с 01:02 Мой предмет (мой тип предмета) 5678 проф. Иванов И.И. 2200, Сидоров С. С. 6543 ст.пр.Петров П.П. Васильев В.В.1234 до 03:04"
                  ]

//let testList2 = List.map (fun _ -> "с 01:02 Мой предмет (мой тип предмета) 5678 проф. Иванов И.И. 2200, Сидоров С. С. 6543 ст.пр.Петров П.П. Васильев В.В.1234 до 03:04") [1..100000]

List.iter (printfn "%A\n") <| ParseCell (List.map (fun (x : string) -> x.ToUpper()) testList)
